[
{
"command": "addRepeatingEvent 15 -1 SendGet http://192.168.0.112/cm?cmnd=Power0%20Toggle",
"description": "This will send a Tasmota HTTP Toggle command every 15 seconds to given device. Repeats value here is '-1' because we want this event to stay forever."
},
{
"command": "addEventHandler OnClick 8 SendGet http://192.168.0.112/cm?cmnd=Power0%20Toggle",
"description": "This will send a Tasmota HTTP Toggle command to given device when a button on pin 8 is clicked (pin 8, NOT channel 8)"
},
{
"command": "addChangeHandler Channel1 != 0 SendGet http://192.168.0.112/cm?cmnd=Power0%20On",
"description": "This will set a Tasmota HTTP Power0 ON command when a channel 1 value become non-zero"
},
{
"command": "addChangeHandler Channel1 == 0 SendGet http://192.168.0.112/cm?cmnd=Power0%20Off",
"description": "This will set a Tasmota HTTP Power0 OFF command when a channel 1 value become zero"
},
{
"command": "addChangeHandler Channel1 == 1 addRepeatingEvent 60 1 setChannel 1 0",
"description": "This will create a new repeating events with 1 repeat count and 60 seconds delay everytime Channel1 becomes 1. Basically, it will automatically turn off the light 60 seconds after you turn it on. TODO: clear previous event instance?"
},
{
"command": "addEventHandler OnChannelChange 1 http://192.168.0.112/cm?cmnd=Power0%20$CH1",
"description": "This is another approach to sending GET for change. As you can see, it's using addEventHandler instead of addChangeHandler. This will fire with every change. The index 1 here is a channel index. The $CH1 macro in URL will get expended to current channel value, usually 1 or 0"
},
{
"command": "addEventHandler2 IR_Samsung 0x707 0x61 led_enableAll 0",
"description": "This will execute console command when IR event is received. Keep in mind it's using addEventHandler2, which is like addEventHandler, but takes two arguments."
},
{
"command": "addClockEvent 8:00:00 0x01 234 backlog led_temperature 500; led_dimmer 100; led_enableAll 1;",
"description": "This will turn on LED with 500 temperature 500, dimmer 100 at 8:00:00 every Sunday (0x01 is a bit flag for Sunday, bit 0 means sunday, bit 1 monday, etc etc), 234 here is unique ID of clock event so you can remove it later. You MUST START NTP driver for it to work."
},
{
"command": "addClockEvent 12:00:00 0x03 567 POWER ON",
"description": "This will turn on POWER at 12:00:00 every Sunday and Monday (0x01 is a bit flag for Sunday, bit 0 means sunday, bit 1 monday, etc etc), 567 here is unique ID of clock event so you can remove it later. You MUST START NTP driver for it to work."
},
{
"command": "addRepeatingEvent 5 -1 led_enableAll !$led_enableAll",
"description": "This simple timer will toggle LED state every 5 seconds. -1 hear means infinite repeats. The ! stands for negation and $led_enableAll is a constant that you can read to get 0 or 1. It works like $CH11, $CH4 etc (any number) for accessing channel value"
}
]