<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Copyright (C) 1988-2020 Free Software Foundation, Inc.

Permission is granted to copy, distribute and/or modify this document
under the terms of the GNU Free Documentation License, Version 1.3 or
any later version published by the Free Software Foundation; with the
Invariant Sections being "Free Software" and "Free Software Needs
Free Documentation", with the Front-Cover Texts being "A GNU Manual,"
and with the Back-Cover Texts as in (a) below.

(a) The FSF's Back-Cover Text is: "You are free to copy and modify
this GNU Manual.  Buying copies from GNU Press supports the FSF in
developing GNU and promoting software freedom." -->
<!-- Created by GNU Texinfo 6.7, http://www.gnu.org/software/texinfo/ -->
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<title>Symbols (Debugging with GDB)</title>

<meta name="description" content="Symbols (Debugging with GDB)">
<meta name="keywords" content="Symbols (Debugging with GDB)">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<link href="index.html" rel="start" title="Top">
<link href="Concept-Index.html" rel="index" title="Concept Index">
<link href="index.html#SEC_Contents" rel="contents" title="Table of Contents">
<link href="index.html" rel="up" title="Top">

defined using a <code>typedef</code>, <code>whatis</code> will <em>not</em> print
the data type underlying the <code>typedef</code>.  If the type of the
variable or the expression is a compound data type, such as
<code>struct</code> or  <code>class</code>, <code>whatis</code> never prints their
fields or methods.  It just prints the <code>struct</code>/<code>class</code>
name (a.k.a. its <em>tag</em>).  If you want to see the members of
such a compound data type, use <code>ptype</code>.
</p>
<p>If <var>arg</var> is a type name that was defined using <code>typedef</code>,
<code>whatis</code> <em>unrolls</em> only one level of that <code>typedef</code>.
Unrolling means that <code>whatis</code> will show the underlying type used
in the <code>typedef</code> declaration of <var>arg</var>.  However, if that
underlying type is also a <code>typedef</code>, <code>whatis</code> will not
unroll it.
</p>
<p>For C code, the type names may also have the form &lsquo;<samp>class
<var>class-name</var></samp>&rsquo;, &lsquo;<samp>struct <var>struct-tag</var></samp>&rsquo;, &lsquo;<samp>union
<var>union-tag</var></samp>&rsquo; or &lsquo;<samp>enum <var>enum-tag</var></samp>&rsquo;.
</p>
<p><var>flags</var> can be used to modify how the type is displayed.
Available flags are:
</p>
<dl compact="compact">
<dt><code>r</code></dt>
<dd><p>Display in &ldquo;raw&rdquo; form.  Normally, <small>GDB</small> substitutes template
parameters and typedefs defined in a class when printing the class&rsquo;
members.  The <code>/r</code> flag disables this.
</p>
</dd>
<dt><code>m</code></dt>
<dd><p>Do not print methods defined in the class.
</p>
</dd>
<dt><code>M</code></dt>
<dd><p>Print methods defined in the class.  This is the default, but the flag
exists in case you change the default with <code>set print type methods</code>.
</p>
</dd>
<dt><code>t</code></dt>
<dd><p>Do not print typedefs defined in the class.  Note that this controls
whether the typedef definition itself is printed, not whether typedef
names are substituted when printing other types.
</p>
</dd>
<dt><code>T</code></dt>
<dd><p>Print typedefs defined in the class.  This is the default, but the flag
exists in case you change the default with <code>set print type typedefs</code>.
</p>
</dd>
<dt><code>o</code></dt>
<dd><p>Print the offsets and sizes of fields in a struct, similar to what the
<code>pahole</code> tool does.  This option implies the <code>/tm</code> flags.
</p>
<p>For example, given the following declarations:
</p>
<div class="example">
<pre class="example">struct tuv
{
  int a1;
  char *a2;
  int a3;
};

struct xyz
{
  int f1;
  char f2;
  void *f3;
  struct tuv f4;
};

union qwe
{
  struct tuv fff1;
  struct xyz fff2;
};

struct tyu
{
  int a1 : 1;
  int a2 : 3;
  int a3 : 23;
  char a4 : 2;
  int64_t a5;
  int a6 : 5;
  int64_t a7 : 3;
};
</pre></div>

<p>Issuing a <kbd>ptype /o struct tuv</kbd> command would print:
</p>
<div class="example">
<pre class="example">(gdb) ptype /o struct tuv
/* offset    |  size */  type = struct tuv {
/*    0      |     4 */    int a1;
/* XXX  4-byte hole  */
/*    8      |     8 */    char *a2;
/*   16      |     4 */    int a3;

                           /* total size (bytes):   24 */
                         }
</pre></div>

<p>Notice the format of the first column of comments.  There, you can
find two parts separated by the &lsquo;<samp>|</samp>&rsquo; character: the <em>offset</em>,
which indicates where the field is located inside the struct, in
bytes, and the <em>size</em> of the field.  Another interesting line is
the marker of a <em>hole</em> in the struct, indicating that it may be
possible to pack the struct and make it use less space by reorganizing
its fields.
</p>
<p>It is also possible to print offsets inside an union:
</p>
<div class="example">
<pre class="example">(gdb) ptype /o union qwe
/* offset    |  size */  type = union qwe {
/*                24 */    struct tuv {
/*    0      |     4 */        int a1;
/* XXX  4-byte hole  */
/*    8      |     8 */        char *a2;
/*   16      |     4 */        int a3;

                               /* total size (bytes):   24 */
                           } fff1;
/*                40 */    struct xyz {
/*    0      |     4 */        int f1;
/*    4      |     1 */        char f2;
/* XXX  3-byte hole  */
/*    8      |     8 */        void *f3;
/*   16      |    24 */        struct tuv {
/*   16      |     4 */            int a1;
/* XXX  4-byte hole  */
/*   24      |     8 */            char *a2;
/*   32      |     4 */            int a3;

                                   /* total size (bytes):   24 */
                               } f4;

                               /* total size (bytes):   40 */
                           } fff2;

                           /* total size (bytes):   40 */
                         }
</pre></div>

<p>In this case, since <code>struct tuv</code> and <code>struct xyz</code> occupy the
same space (because we are dealing with an union), the offset is not
printed for them.  However, you can still examine the offset of each
of these structures&rsquo; fields.
</p>
<p>Another useful scenario is printing the offsets of a struct containing
bitfields:
</p>
<div class="example">
<pre class="example">(gdb) ptype /o struct tyu
/* offset    |  size */  type = struct tyu {
/*    0:31   |     4 */    int a1 : 1;
/*    0:28   |     4 */    int a2 : 3;
/*    0: 5   |     4 */    int a3 : 23;
/*    3: 3   |     1 */    signed char a4 : 2;
/* XXX  3-bit hole   */
/* XXX  4-byte hole  */
/*    8      |     8 */    int64_t a5;
/*   16: 0   |     4 */    int a6 : 5;
/*   16: 5   |     8 */    int64_t a7 : 3;
&quot;/* XXX  7-byte padding  */

                           /* total size (bytes):   24 */
                         }
</pre></div>

<p>Note how the offset information is now extended to also include the
first bit of the bitfield.
</p></dd>
</dl>

<span id="index-ptype"></span>
</dd>
<dt><code>ptype[/<var>flags</var>] [<var>arg</var>]</code></dt>
<dd><p><code>ptype</code> accepts the same arguments as <code>whatis</code>, but prints a
detailed description of the type, instead of just the name of the type.
See <a href="Expressions.html">Expressions</a>.
</p>
<p>Contrary to <code>whatis</code>, <code>ptype</code> always unrolls any
<code>typedef</code>s in its argument declaration, whether the argument is
a variable, expression, or a data type.  This means that <code>ptype</code>
of a variable or an expression will not print literally its type as
present in the source code&mdash;use <code>whatis</code> for that.  <code>typedef</code>s at
